---
kind: type
id: T:Autodesk.Revit.DB.BaseArray
source: html/d7f9a542-0333-2e10-83a2-98afcee00b80.htm
---
# Autodesk.Revit.DB.BaseArray

An abstract base class that represents an array within the Revit project.

## Syntax (C#)
```csharp
public abstract class BaseArray : Element
```